app/controllers/locations_controller.rb

SELECT * FROM `locations` ORDER BY population DESC LIMIT 0, 12
SELECT count(*) AS count_all FROM `locations`
---
  def index
    # @locations = Location.all
    if params[:search]
      @locations = Location.name_like(params["search"]["query"]).paginate(:page => params[:page], :order => 'population DESC')

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def show
    @location = Location.find(params[:id])